{
    "directory": [
        {
            "name": "Palacio de Cibeles",
            "address": "Plaza de Cibeles, 1, 28014 Madrid, Spain",
            "description": "Originally built between 1907 and 1919 as the headquarters for Spain postal and telegraph services, Palacio de Cibeles is a grand Neo-Plateresque building designed by Antonio Palacios and Joaquín Otamendi. It now serves as Madrid's City Hall and houses CentroCentro, a cultural center with exhibitions and a panoramic rooftop terrace overlooking the Plaza de Cibeles.",
            "img":
        },
        {
            "name": "Puerta de Alcalá",
            "address": "Plaza de la Independencia, s/n, 28001 Madrid, Spain",
            "description": "The Puerta de Alcalá is a Neoclassical triumphal arch built between 1769 and 1778, commissioned by King Charles III and designed by Francesco Sabatini. It replaced a 16th-century city gate and served as one of the five royal entrances to Madrid. With its five arches, granite and limestone construction, and ornamental sculptures, it is one of the city's most iconic monuments, located near Retiro Park.",
            "img":
        },
        {
            "name": "Templo de Debod",
            "address": "Paseo del Pintor Rosales, 3, 28008 Madrid, Spain",
            "description": "An ancient Egyptian temple dating back to the 2nd century BC, relocated to Madrid in the 20th century. It offers beautiful views and sunset spots.",
            "img":
        },
        {
            "name": "Edificio Metrópolis",
            "address": "Calle de Alcalá, 39, 28014 Madrid, Spain",
            "description": "Built between 1907-1910 in Beaux-Arts style, known for its ornate dome covered with gold leaves and the iconic winged statue on top.",
            "img":
        },
        {
            "name": "Estatua del Oso y el Madroño",
            "address": "Puerta del Sol, Madrid, Spain",
            "description": "Symbolic statue representing Madrid's coat of arms, featuring a bear and a strawberry tree, created in 1967 and located in the city's central square.",
            "img":
        },
        {
            "name": "Gran Vía",
            "address": "From Calle de Alcalá to Plaza de España, Madrid, Spain",
            "description": "A bustling boulevard known for early 20th-century architecture, theaters, shops, and vibrant nightlife, often called Madrid's Broadway.",
            "img"
        },
        {
            "name": "Parque del Retiro",
            "address": "Retiro District, Madrid, Spain",
            "description": "Historic park created in 1630, featuring gardens, monuments, a large pond with rowboats, and cultural spaces like the Crystal Palace.",
            "img":
        },
        {
            "name": "Plaza Mayor",
            "address": "Calle Mayor, Madrid, Spain",
            "description": "A rectangular historic square from 1619, surrounded by arcaded buildings and cafes, with the equestrian statue of King Philip III at its center.",
            "img":
        }

    ]
}